---
type: DocumentClosedEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# DocumentClosedEventArgs

`Autodesk.Revit.DB.Events.DocumentClosedEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | DocumentId | 2010 | `public int DocumentId { get ; }` |